Autodesk.Revit.DB.ChangePriority
Enum used to specify the priority of an Updater during execution.
Remarks:
The enumeration values are ordered in the order in which updaters associated to each
priority will be run.  For example, updaters associated to priority GridsLevelsReferencePlanes
will run first, while updaters associated to priority Annotations will run last.
Since:
2011

Autodesk.Revit.DB.ChangePriority.Annotations
Updater will modify annotations

Autodesk.Revit.DB.ChangePriority.DetailComponents
Updater will modify detail components and symbolic lines

Autodesk.Revit.DB.ChangePriority.Views
Updater will modify views

Autodesk.Revit.DB.ChangePriority.MEPSystems
Updater will modify MEP systems or circuits

Autodesk.Revit.DB.ChangePriority.MEPAccessoriesFittingsSegmentsWires
Updater will modify MEP elements such as segments, fittings and wires

Autodesk.Revit.DB.ChangePriority.Rebar
Updater will modify rebar

Autodesk.Revit.DB.ChangePriority.Connections
Updater will modify connections

Autodesk.Revit.DB.ChangePriority.FreeStandingComponents
Updater will modify standalone components

Autodesk.Revit.DB.ChangePriority.MEPCalculations
Updater will update MEP calculated values

Autodesk.Revit.DB.ChangePriority.RoomsSpacesZones
Updater will modify Rooms, MEP spaces or zones

Autodesk.Revit.DB.ChangePriority.MEPFixtures
Updater will modify MEP fixtures such as lights, sinks, equipment, etc.

Autodesk.Revit.DB.ChangePriority.DoorsOpeningsWindows
Updater will modify family instances that cut their hosts like doors and windows

Autodesk.Revit.DB.ChangePriority.InteriorWalls
Updater will modify interior/partition walls

Autodesk.Revit.DB.ChangePriority.Structure
Updater will modify structural elements like beams, braces, columns and trusses

Autodesk.Revit.DB.ChangePriority.FloorsRoofsStructuralWalls
Updater will modify exterior shell of the building or floor slabs

Autodesk.Revit.DB.ChangePriority.Masses
Updater will modify masses

Autodesk.Revit.DB.ChangePriority.GridsLevelsReferencePlanes
Updater will modify core datums and major reference planes